// AcademyOne.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

/*
#include <stdio.h> // Вызов\\Включение библиотеки <stdio.h> Библиотека вывода

int main(void) // (скобки - строительный блок, функция) Начинает исполнение программы
{
    printf("Hello,\nTo\nC##\nLuck\n"); // \n переносит на след.строку
	
	return 0; // Завершение программы
}
*/


/*
\n  - Новая строка.Перемещает курсор в начало новой строки
\t - Горизонтальная табуляция. Перемещает курсор в следующую позицию табуляции
\r - Возврат каретки. Перемещение курсора в начало текущей строки без перемещения на следующую строку
\a - Звуковой системный сигнал оповещения
\\ - Обратная косая черта. Вывод на экран сивола \ при помощи оператора printf
\" - Двойные кавычки. Вывод на экран сивола двойных кавычек посредством опертора printf
*/

/*
#include <stdio.h>
 int main()
{
	int a = 10, d = 10, sum = a + d;
	printf("%d + %d = %d\n", a, d, sum);  // %d - преобразование целого числа (a, b, sum - операнды)
	// scanf('%d', a + d); // Оператор преобразование к числу ("??", операнды)
	return 0;
}
*/
 
 /*
 %с	Считать один символ
 %d	Считать десятичное число целого типа
 %i	Считать десятичное число целого типа
 %е	Считать число с плавающей запятой
 %f	Считать число с плавающей запятой
 %g	Считать число с плавающей запятой
 %о	Считать восьмеричное число
 %s	Считать строку
 %х	Считать шестнадцатиричное число
 %р	Считать указатель
 %n	Принимает целое значение, равное количеству считанных до текущего момента символов
 %u	Считывает беззнаковое целое
 %[] Просматривает набор символов
 %%	Считывает символ %
 */


 
 
 
 
 // Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
